// --------------------------------------------------
// Задание #1
// --------------------------------------------------

// End
// Promise
// Promise resolve
// setTimeout


// --------------------------------------------------
// Задание #2
// --------------------------------------------------

// before promise
// One
// Zero
// Zero Promise
// Zero Promise Invoked


// --------------------------------------------------
// Задание #3
// --------------------------------------------------

// End
// Success
// user received
// in promise
// last set timeout
// promise resolved

